<?php
// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------

return [
    // 默认缓存驱动
    'default' => env('cache.driver', 'redis'),

    // 缓存连接方式配置
    'stores'  => [
        'file' => [
            // 驱动方式
            'type'       => 'File',
            // 缓存保存目录
            'path'       => '',
            // 缓存前缀标识
            'prefix'     => '',
            // 缓存的有效期
            'expire'     => 0,
            // 缓存标签前缀
            'tag_prefix' => 'tag:',
            // 序列化的机制
            'serialize'  => [],
        ],
        'redis' => [
            // 驱动方式
            'type'     => 'redis',
            // 服务地址
            'host'     => '127.0.0.1',
            // 服务端口
            'port'     => 6379,
            // 服务密码
            'password' => '',
            // 库的索引
            'database' => 0
        ],
        'memcache' => [
            // 驱动方式
            'type'     => 'memcache',
            // 服务地址
            'host'     => '127.0.0.1',
            // 服务端口
            'port'     => 11211,
            // 服务密码
            'password' => ''
        ]
    ],
];
